var arrImg=["1.jpg","2.jpg","3.jpg","4.jpg","5.jpg","6.jpg","7.jpg","8.jpg","9.jpg","10.jpg","11.jpg"]
var arrH=["海滩日光浴","水上活动","潜水","短桨滑水","滑水橇/板","独木舟探索洞穴","泰式按摩","浮潜和喂鱼","岛屿参观/岛屿徒步","海上摩托艇","攀岩"]
var arrP=["挑一处自己喜欢的海滩悠哉躺着或安静读本书 。若你只想躺在甲板上，让海浪拍打着船体的声音带您进入梦乡，或来个舒缓的按摩，海钓都可以！",
    "亲身体验“水上飘”，多种滑水设备可供选择！向自己的平衡感和勇气发起挑战的同时，感受拥抱整片大海的喜悦和惬意。",
    "你拥有国际专业潜水教练协会的潜水执照吗？我们为那些热爱探索海底世界的潜水者提供潜水服务。来和五彩缤纷的海底生物一起畅游或是和海龟来个自拍吧！",
    "试试用短桨滑水来探索清澈美丽的海洋！这项悠闲放松的活动结合身体轻度运动和平衡感。有经验的或平衡感不错的你，或许能成功在板上做上几个瑜伽动作喔！",
    "拿起我們的滑水橇或板，尝试一下这刺激的活动！這個活動没有年龄限制，适合全家一起来玩。在 3 天的行程结束时，你可能已经学会几个技巧了呢！",
    "对神秘的洞穴暗道充满好奇，跃跃欲试？何不乘上小小独木舟，顺流缓慢前行，感受最原始的海洋探索之旅，与伙伴们留下最难忘的记忆。",
    "传统的泰式按摩是一种古老的疗愈方法之一，透过独特按摩手法按压、拉、 拉伸和震动，释放身体的压力和恢复活力。位于天堂度假村获奖的水疗中心，将带给你最优质的服务。",
    "在美丽的天然泻湖中自在浮游，或亲自潜入水底与海洋生物亲密接触，还能够给海洋鱼类喂食喔！带上朋友来一场欢乐的水下之旅！",
    "踏上美丽富饶的海岛，呼吸一缕清新的空气。漫步于丛林中，发现长臂猿，犀鸟和其他的惊喜。在宁静的世外桃源留下属于自己的足迹。",
    "Arabella号的摩托艇带给你在海上风驰电掣的刺激感受，在阳光海岸尽情飞驰，享受勇者的呐喊和欢呼！",
    "想要做一个攀爬海岸的酷小孩？来体验把大海踩在脚下，用双手触碰蓝天的壮阔奇妙。挑战自己的力量极限，你就是勇者!"]
var num=1;
function changeMore() {
    num++;
    console.log(num);
    if(num>(arrImg.length)){
        num=1;
    }
    $(".h2").html(arrH[num-1]);
    $("img").attr("src","../../images/sail/activities-more/"+arrImg[num-1]);
    $(".p").html(arrP[num-1]);


}